### Ordinal Number Encoding

In [2]:
import pandas as pd
import datetime

In [3]:
today_date=datetime.datetime.today()

In [4]:
today_date

datetime.datetime(2021, 6, 17, 22, 18, 14, 688179)

In [7]:
today_date-datetime.timedelta(15)

datetime.datetime(2021, 6, 2, 22, 18, 14, 688179)

In [8]:
#### list comprehension
[today_date-datetime.timedelta(x) for x in range(0,15)]

[datetime.datetime(2021, 6, 17, 22, 18, 14, 688179),
 datetime.datetime(2021, 6, 16, 22, 18, 14, 688179),
 datetime.datetime(2021, 6, 15, 22, 18, 14, 688179),
 datetime.datetime(2021, 6, 14, 22, 18, 14, 688179),
 datetime.datetime(2021, 6, 13, 22, 18, 14, 688179),
 datetime.datetime(2021, 6, 12, 22, 18, 14, 688179),
 datetime.datetime(2021, 6, 11, 22, 18, 14, 688179),
 datetime.datetime(2021, 6, 10, 22, 18, 14, 688179),
 datetime.datetime(2021, 6, 9, 22, 18, 14, 688179),
 datetime.datetime(2021, 6, 8, 22, 18, 14, 688179),
 datetime.datetime(2021, 6, 7, 22, 18, 14, 688179),
 datetime.datetime(2021, 6, 6, 22, 18, 14, 688179),
 datetime.datetime(2021, 6, 5, 22, 18, 14, 688179),
 datetime.datetime(2021, 6, 4, 22, 18, 14, 688179),
 datetime.datetime(2021, 6, 3, 22, 18, 14, 688179)]

In [9]:
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [10]:
data=pd.DataFrame(days)
data.columns=['Day']

In [13]:
data.head()

                         Day
0 2021-06-17 22:18:14.688179
1 2021-06-16 22:18:14.688179
2 2021-06-15 22:18:14.688179
3 2021-06-14 22:18:14.688179
4 2021-06-13 22:18:14.688179

In [24]:
data['Day'].dt.day_name()

0      Thursday
1     Wednesday
2       Tuesday
3        Monday
4        Sunday
5      Saturday
6        Friday
7      Thursday
8     Wednesday
9       Tuesday
10       Monday
11       Sunday
12     Saturday
13       Friday
14     Thursday
Name: Day, dtype: object

In [26]:
data['Day'].dt.day

0     17
1     16
2     15
3     14
4     13
5     12
6     11
7     10
8      9
9      8
10     7
11     6
12     5
13     4
14     3
Name: Day, dtype: int64

In [27]:
data['weekday']=data['Day'].dt.day_name()
data.head()

                         Day    weekday
0 2021-06-17 22:18:14.688179   Thursday
1 2021-06-16 22:18:14.688179  Wednesday
2 2021-06-15 22:18:14.688179    Tuesday
3 2021-06-14 22:18:14.688179     Monday
4 2021-06-13 22:18:14.688179     Sunday

In [28]:
dictionary={
    'Monday':1,
    'Tuesday':2,
    'Wednesday':3,
    'Thursday':4,
    'Friday':5,
    'Saturday':6,
    'Sunday':7
}

In [29]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [32]:
data['weekday_ordinal']=data['weekday'].map(dictionary)
data

                          Day    weekday  weekday_ordinal
0  2021-06-17 22:18:14.688179   Thursday                4
1  2021-06-16 22:18:14.688179  Wednesday                3
2  2021-06-15 22:18:14.688179    Tuesday                2
3  2021-06-14 22:18:14.688179     Monday                1
4  2021-06-13 22:18:14.688179     Sunday                7
5  2021-06-12 22:18:14.688179   Saturday                6
6  2021-06-11 22:18:14.688179     Friday                5
7  2021-06-10 22:18:14.688179   Thursday                4
8  2021-06-09 22:18:14.688179  Wednesday                3
9  2021-06-08 22:18:14.688179    Tuesday                2
10 2021-06-07 22:18:14.688179     Monday                1
11 2021-06-06 22:18:14.688179     Sunday                7
12 2021-06-05 22:18:14.688179   Saturday                6
13 2021-06-04 22:18:14.688179     Friday                5
14 2021-06-03 22:18:14.688179   Thursday                4

### Count Or Frequency Encoding

In [65]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [66]:
## in column 1 there are 9 unique categories 
train_set[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [67]:
len(train_set[1].unique())

9

In [68]:
columns=[1,3,5,6,7,8,9,13]

In [69]:
## need to store the columns value in df-train_set
train_set=train_set[columns]

In [70]:
train_set.columns=['Employment','Degree','Status','Designation','Family','Race','Sex','Country']

In [71]:
train_set.head()

,Employment,Degree,Status,Designation,Family,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [72]:
for feature in train_set.columns[:]:
    print(feature,':',len(train_set[feature].unique()), 'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
Family : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [73]:
country_map=train_set['Country'].value_counts().to_dict()

In [74]:
train_set['Country']=train_set['Country'].map(country_map)

In [76]:
train_set.head(20)

,Employment,Degree,Status,Designation,Family,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

##### Frequency encoding 
Advantages 
1. Easy to use
2. Not increasing feature space 

Disadvantages
1. It will provide same weight if the frequencies are same 
(i.e country- China, India, have same lengh, they map as 5

#### Target Guided Ordinal Encoding
1. Ordering the labels according to the target

   i.e in this case, found out the cabin survived rate then assign back their survived rank 
   
2. Replace the labels by the joint probability of being 1 or 0

In [77]:
df=pd.read_csv('./titanic/train.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [78]:
df['Cabin'].fillna('Missing',inplace=True)

In [80]:
df.head(10)


### For cabin, we want to find out the blocks instead of seat,
### C85 --> C  E46-->E

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing
5         0  Missing
6         0      E46
7         0  Missing
8         1  Missing
9         1  Missing

In [82]:
## convert data intro string, and pick the first letter
df['Cabin'].astype(str).str[0]

0      M
1      C
2      M
3      C
4      M
      ..
886    M
887    B
888    M
889    C
890    M
Name: Cabin, Length: 891, dtype: object

In [83]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [84]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [85]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [86]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [89]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [90]:
ordinal_label=df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [91]:
ordinal_label

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [93]:
### k --> index value (T,M,A ...) i --> label them start with 0
ordinal_label2={k:i for i, k in enumerate(ordinal_label,0)}
ordinal_label2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [94]:
df['Cabin_ordinal_label']=df['Cabin'].map(ordinal_label2)

In [97]:
df.head()

   Survived Cabin  Cabin_ordinal_label
0         0     M                    1
1         1     C                    4
2         1     M                    1
3         1     C                    4
4         0     M                    1

#### Mean encoding

In [101]:
df.groupby(['Cabin'])['Survived'].mean().to_dict()

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [99]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [102]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [103]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)

In [104]:
df.head()

   Survived Cabin  Cabin_ordinal_label  mean_ordinal_encode
0         0     M                    1             0.299854
1         1     C                    4             0.593220
2         1     M                    1             0.299854
3         1     C                    4             0.593220
4         0     M                    1             0.299854

#### Mean Encoding
Advantage
1. Capture the information within the label, so rendering more predictive
features
2. Create monotonic relationship between variable and a target

Disadvantage
1. The mean prones to overfitting

#### Probability Ratio Encoding
Steps:
1. Probability of Survived based on Cabin -- Categorical Feature
2. Probability of Not Survived -- 1-prob(Survived)
3. ratio = Prob(survived)/ Prob(Not Survived)
4. Dictionary to map Cabin with probability ratio 
5. Replace with the categorical feature

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('./titanic/train.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [3]:
df['Cabin'].fillna('Missing', inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [4]:
df['Cabin'].unique()

array(['Missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [5]:
df['Cabin']=df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [6]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [8]:
prob_df=df.groupby(['Cabin'])['Survived'].mean()

In [9]:
prob_df=pd.DataFrame(prob_df)
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [12]:
prob_df['Died']=1-prob_df['Survived']
prob_df.head()

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000

In [13]:
prob_df['Probability_ratio']=prob_df['Survived']/prob_df['Died']

In [15]:
prob_df

       Survived      Died  Probability_ratio
Cabin
A      0.466667  0.533333           0.875000
B      0.744681  0.255319           2.916667
C      0.593220  0.406780           1.458333
D      0.757576  0.242424           3.125000
E      0.750000  0.250000           3.000000
F      0.615385  0.384615           1.600000
G      0.500000  0.500000           1.000000
M      0.299854  0.700146           0.428274
T      0.000000  1.000000           0.000000

In [17]:
probability_encoded=prob_df['Probability_ratio'].to_dict()

In [18]:
df['Cabin_encoded']=df['Cabin'].map(probability_encoded)

In [20]:
df.head(10)

   Survived Cabin  Cabin_encoded
0         0     M       0.428274
1         1     C       1.458333
2         1     M       0.428274
3         1     C       1.458333
4         0     M       0.428274
5         0     M       0.428274
6         0     E       3.000000
7         0     M       0.428274
8         1     M       0.428274
9         1     M       0.428274